In [2]:
import pandas as pd
# 数据分箱
df1 = pd.read_csv('data/nba.csv')
df = df1[5:15][['Name', 'Salary']]
df

               Name      Salary
5      Amir Johnson  12000000.0
6     Jordan Mickey   1170960.0
7      Kelly Olynyk   2165160.0
8      Terry Rozier   1824360.0
9      Marcus Smart   3431040.0
10  Jared Sullinger   2569260.0
11    Isaiah Thomas   6912869.0
12      Evan Turner   3425510.0
13      James Young   1749840.0
14     Tyler Zeller   2616975.0

In [10]:
# 等距划分
pd.cut(df['Salary'], bins=3)  # bins=n, 分成n段区间
#1160130.96 ~ 6585480.0 ~ 12000000.0
pd.cut(df['Salary'], bins=3).value_counts()
pd.cut(df['Salary'], bins=[0, 4000000, 8000000, 12000000])  # bin=list, 分成n段区间
df['收入范围'] = pd.cut(df['Salary'], bins=[0, 4000000, 8000000, 12000000],
                        labels=['低', '中', '高'])
# 数值=>分箱=>统计
# df['gender'] = df['gender'].astype('category')  # 分类类型  字符串=>类别=>统计
# df['gender'].value_counts()
df

Salary
(1160130.96, 4780640.0]    8
(4780640.0, 8390320.0]     1
(8390320.0, 12000000.0]    1
Name: count, dtype: int64

In [5]:
# 等频划分
pd.qcut(df['Salary'],3).value_counts()

Salary
(3425510.0, 12000000.0]     4
(1170959.999, 2165160.0]    3
(2165160.0, 3425510.0]      3
Name: count, dtype: int64

In [24]:
# df.set_index('Name', inplace=True) # 设置索引
# df.reset_index(inplace=True) # 重置索引
df.rename(columns={'Name':'姓名','Salary':'工资'},index={5:'第五'})   # 重命名索引

                  名           钱  范
1      Amir Johnson  12000000.0  高
2     Jordan Mickey   1170960.0  低
3      Kelly Olynyk   2165160.0  低
4      Terry Rozier   1824360.0  低
第五     Marcus Smart   3431040.0  低
6   Jared Sullinger   2569260.0  低
7     Isaiah Thomas   6912869.0  中
8       Evan Turner   3425510.0  低
9       James Young   1749840.0  低
10     Tyler Zeller   2616975.0  低

In [22]:
# 一次全部修改
df.index=[1,2,3,4,5,6,7,8,9,10]
df.columns=['名','钱','范']
df

                  名           钱  范
1      Amir Johnson  12000000.0  高
2     Jordan Mickey   1170960.0  低
3      Kelly Olynyk   2165160.0  低
4      Terry Rozier   1824360.0  低
5      Marcus Smart   3431040.0  低
6   Jared Sullinger   2569260.0  低
7     Isaiah Thomas   6912869.0  中
8       Evan Turner   3425510.0  低
9       James Young   1749840.0  低
10     Tyler Zeller   2616975.0  低